maksonlee/esp32-ble-mqtt-x509-thingsboard/sdkconfig.defaults
# Original ESP32 with 4 MB flash; required by partitions.csv.
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# BLE provisioning using NimBLE.
CONFIG_BT_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=n
CONFIG_BTDM_CTRL_MODE_BTDM=n
CONFIG_BT_NIMBLE_ENABLED=y

# Preserve the existing Security 1 provisioning protocol.
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_1=y
CONFIG_NETWORK_PROV_NETWORK_TYPE_WIFI=y

# Keep the existing OTA slots and SPIFFS layout.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# IDF 6.x places FreeRTOS functions in flash unless this option is enabled.
CONFIG_FREERTOS_IN_IRAM=n
